// /*++
// Copyright (c) 2009 Intel Corporation. All rights reserved.
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
// --*/
/=#
#langdef   en-US "English"
#langdef   zh-Hans "\wide中文\narrow"

#string STR_CSM_OPROM_DISPLAY_MODE          #language en-US "Option ROM Messages"
                                            #language zh-Hans "Option ROM Messages"
#string STR_CSM_OPROM_DISPLAY_MODE_HELP     #language en-US "Set display mode for Option ROM"
                                            #language zh-Hans "Set display mode for Option ROM"
#string STR_CSM_OPROM_DISPLAY_FORCE_BIOS    #language en-US "Force BIOS"
                                            #language zh-Hans "Force BIOS"
#string STR_CSM_OPROM_DISPLAY_KEEP_CURRENT  #language en-US "Keep Current"
                                            #language zh-Hans "Keep Current"
#string STR_CSM_HDD_BOOTSECTOR_WP           #language en-US "HDD BootSector Write"
                                            #language zh-Hans "HDD BootSector Write"
#string STR_CSM_HDD_BOOTSECTOR_WP_HELP      #language en-US "Enables/Disables writes to Hard Disk Sector 0"
                                            #language zh-Hans "Enables/Disables writes to Hard Disk Sector 0"
#string STR_CSM_HDD_BOOTSECTOR_NORMAL       #language en-US "Normal"
                                            #language zh-Hans "Normal"
#string STR_CSM_HDD_BOOTSECTOR_WRITEPROTECT #language en-US "Write Protect"
                                            #language zh-Hans "Write Protect"
#string STR_CSM_I19_TRAP                    #language en-US "Interrupt 19 Capture"
                                            #language zh-Hans "Interrupt 19 Capture"
#string STR_CSM_I19_TRAP_HELP               #language en-US "Enabled: Allows Option ROMs to trap int 19"
                                            #language zh-Hans "Enabled: Allows Option ROMs to trap int 19"
#string STR_CSM_ZIP_EMULATION_PROMPT        #language en-US "ZIP Emulation Type"
                                            #language zh-Hans "ZIP Emulation Type"
#string STR_CSM_ZIP_EMULATION_HELP          #language en-US "Set the Emulation type for ZIP drives"
                                            #language zh-Hans "Set the Emulation type for ZIP drives"
#string STR_CSM_ZIP_EMULATION_FDD           #language en-US "Floppy"
                                            #language zh-Hans "Floppy"
#string STR_CSM_ZIP_EMULATION_HDD           #language en-US "Hard Drive"
                                            #language zh-Hans "Hard Drive"
